---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AreaReinforcementType
source: html/f0c0005f-bd5d-fed1-f7c0-e3280acaf9fa.htm
---
# AreaReinforcementType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.